read_verilog src/*.v

synth -flatten -top cpu
flatten cpu

abc -liberty scripts/gates.lib

read_verilog scripts/not.v
flatten cpu

select *
select -del cpu
delete
select -none

write_verilog bin/synth.v
write_blif bin/synth.blif